Revit 2024 API
DirectShapeType.ResetExternallyTaggedGeometry Method
 Removes all of the externally tagged geometry in this DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void ResetExternallyTaggedGeometry()
Visual Basic
Public Sub ResetExternallyTaggedGeometry
Visual C++
public:
void ResetExternallyTaggedGeometry()
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace